# Index 다루기

- 인덱스의 일부를 변경하는 경우

- 특정 컬럼을 인덱스로 설정하는 경우

- 기존 인덱스에 새로 추가하는 경우

- O-base 인덱스로 리셋하는 경우

In [3]:
# 모듈 로딩
import pandas as pd

# DF 객체 생성
df = pd.DataFrame({'이름':['서준','우현','인아'],
                  '수학':[90,80,70], '영어':[98,89,95],
             '음악':[85,95,100], '체육':[100,90,90]})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   수학      3 non-null      int64
 2   영어      3 non-null      int64
 3   음악      3 non-null      int64
 4   체육      3 non-null      int64
dtypes: int64(4), object(1)
memory usage: 248.0+ bytes

In [4]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [5]:
# DF의 속성 읽기 -> index, columns, shape
print(f'df.index => {df.index}\n',f'df.columns => {df.columns}\n',f'df.shape => {df.shape}')
df.index
df.columns
df.shape

df.index => RangeIndex(start=0, stop=3, step=1)
 df.columns => Index(['이름', '수학', '영어', '음악', '체육'], dtype='object')
 df.shape => (3, 5)

(3, 5)

In [6]:
# 0,1,2 보다 '서준','우현','인아'을 인덱스로 설정하는 것 

# 특정 컬럼을 인덱스로 설정 => 중복, NaN(Not a Number)
# ex) 이름과 전화번호를 같이 합쳐서 컬럼으로 쓰면서 중복을 피하는 방법도 있음
 # 이 두가지가 주말 과제에 나왔던 컬럼 합치기 인 것 같은데, 선생님 과제 리뷰하면서 다시 복기할 것

# 특정 컬럼을 인덱스로 설정

- 조건 : 중복안되는 것으로
/ Nan(Not a Number) : 빈칸 의미

- 생성 : DF객체변수명.set_index('컬럼명', inplace=False) <- 기본값  
    DF객체변수명.set_index(['컬럼명', '컬럼명'], inplace=False) <- 기본값

In [7]:
# 이름 컬럼 => 행 인덱스 설정 (중복 안되니까)
df1 = df.set_index('이름', inplace=True)
# df1 = df.set_index('이름')
# df1 = df.set_index('이름', inplace=True)로 하면 원본 자체를 넘겨 버려서 df1로 부르면 None으로 뜨게 되는 것임
df1

In [8]:
df.index

# @ inplace 써서 df로 조회해도 똑같이 나오는 건지 흐름 알기

Index(['서준', '우현', '인아'], dtype='object', name='이름')

# 인덱스 초기화(리셋)

- 기존의 컬럼 인덱스 => 컬럼 돌려주기
- 메서드 : DF객체변수명.reset_index()  =>  inplace = False 파라미터로 설정

In [9]:
df.reset_index(inplace=True)
# 원본에 그대로 적용이 되었기 때문에 아무것도 출력되지 않음

In [10]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [11]:
# 행(row) 추가
df.loc[3]=['현진', 100, 100, 100, 100]
df

   이름   수학   영어   음악   체육
0  서준   90   98   85  100
1  우현   80   89   95   90
2  인아   70   95  100   90
3  현진  100  100  100  100

In [12]:
# 잘못 적었는지 'index'라는 것이 뜨고, 입력하는 것도 반대로 돌려써야 정상적으로 추가됨
df.loc[3]=['인아', 100, 100, 100, 100]
df

   이름   수학   영어   음악   체육
0  서준   90   98   85  100
1  우현   80   89   95   90
2  인아   70   95  100   90
3  인아  100  100  100  100

In [32]:
# 이름 컬럼 중복되는 중 => 2개의 컬럼을 합쳐서 인덱스로 하는 방법도 있음 => 멀티 인덱스
# 특정 컬럼 인덱스로 설정 (수학이 안겹치니까 일단) 
df2 = df.set_index(['이름','수학'])
# df2['이름 수학'] = df2['이름'] + df2['수학']
df2

         영어   음악   체육
이름 수학
서준 90    98   85  100
우현 80    89   95   90
인아 70    95  100   90
   100  100  100  100

In [33]:
df2.shape
# 위의 표에서 봤을 때, 행은 4줄, 컬럼은 '영어','음악','체육' 이렇게 3개라는 것임
# 즉, '이름'과 '수학'이 인덱스가 되면서 하나로 함께 움직인다고 보면 되는 것임 & 컬럼이 아님
# 따라서, 두 컬럼을 인덱스로 둔 이후부터는, 두를 합친다거나 하는 편집은 불가능 하다는 것

(4, 3)

# 인덱스 재배열 설정

- 기존 인덱스에 변경을 가하는 것

- 원본 적용 inplace = False 기존값

- 메서드 : DF객체변수명.reindex([인덱스 리스트], fill_value = 값)

In [15]:
df

   이름   수학   영어   음악   체육
0  서준   90   98   85  100
1  우현   80   89   95   90
2  인아   70   95  100   90
3  인아  100  100  100  100

In [16]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [17]:
# df1 = df.reindex([0,1,2,3,4,5])하면 값이 'NaN'으로 4,5행이 가득 차고
df1 = df.reindex([0,1,2,3,4,5], fill_value = 0) #으로 하면 NaN으로 찼던 곳들이 '0'으로 모두 참
df1
# 변경이 이뤄지면 정수 -> 실수가 됨
# 로우나 행 추가하고 나면 값이 실수로 바뀜

   이름   수학   영어   음악   체육
0  서준   90   98   85  100
1  우현   80   89   95   90
2  인아   70   95  100   90
3  인아  100  100  100  100
4   0    0    0    0    0
5   0    0    0    0    0

In [18]:
df1 = df.reindex([0,'a'], fill_value=0)
df1.shape

(2, 5)

In [19]:
df1
# 재배열 하고자 하는 행 [0,'a'] 중에
# 있는 행 [0]은 가져오고,
# 없는 행 ['a']은 추가하고,
# 그 외에 기존의 index에 남은 행은 삭제한다
# 컬럼을 인덱스로 가져오는 경우 많음

   이름  수학  영어  음악   체육
0  서준  90  98  85  100
a   0   0   0   0    0

# 인덱스 & 컬럼 일부분 변경

- 컬럼에 따른 데이터가 잘 못 들어가 있는 경우,
- columns를 쓰면 다 입력해야 하지만,
- 특정 부분만 바꾸는 위한 것  
- 기존 인덱스/컬럼에서 일부분 변경하는 메서드  
- DF객체변수명.rename(index={기존:새}, inplace = False)
- DF객체변수명.rename(columns={기존:새}, inplace = False)
=> index변경이면 index만, column변경이면 columns만 파라미터 골라서 쓰면됨

In [20]:
# 위에 한줄 띄우는 거 다시 (공백 넣기)

In [21]:
df

   이름   수학   영어   음악   체육
0  서준   90   98   85  100
1  우현   80   89   95   90
2  인아   70   95  100   90
3  인아  100  100  100  100

In [22]:
# 수학 => MATH, 음악 => MUSIC
df.rename(columns={'수학':'MATH', '음악':'MUSIC'}) # 바꾼 복사본을 출력 하는 것이지
# 여기서 df를 출력하면 바뀌지 않은 원본이 나오는 것이지

   이름  MATH   영어  MUSIC   체육
0  서준    90   98     85  100
1  우현    80   89     95   90
2  인아    70   95    100   90
3  인아   100  100    100  100

In [23]:
df2 = df.rename(columns={'수학':'MATH', '음악':'MUSIC'})
# 담아주고 뿌려야 df2만 쳤을 때 나오게 되는 것이지
df2

   이름  MATH   영어  MUSIC   체육
0  서준    90   98     85  100
1  우현    80   89     95   90
2  인아    70   95    100   90
3  인아   100  100    100  100

In [24]:
# df.reset.index(inplace=True)
# inplace를 잘못하면 당황하게 만들었던 index를 끌어다가 복구되기 때문에

In [25]:
# 대응되는 데이터가 없으면 계산하지 않음
# 메서드도 앞에 _나 __를 주면 외부에서 보이지 않음 (정보은닉 기능)